#include "global.h"

std::map<std::string, std::string> g_JType = {
	//网路管理
	{"0 0", "初始入网"},			{"0 1", "测试"},				{"0 2", "网络时间更新"},
	{"0 3" , "时隙分配"},			{"0 4", "无线电中继控制"},		{"0 5", "二次传播中继"},
	{"0 6", "通信控制"},			{"0 7", "时隙再分配"},			{"1 0", "连通性询问"},
	{"1 1", "连通状态"},			{"1 2", "路由建立"},			{"1 3", "确认"},
	{"1 4", "通讯者状态"},			{"1 5", "网络控制初始化"},		{"1 6", "需求链参与组分配"},
	{"2 0", "间接接口单元PPLI"},	{"2 2", "空中PPLI"},			{"2 3", "水面PPLI"},
	{"2 4", "水下PPLI"},			{"2 5", "路地点PPLI"},			{"2 6", "陆地轨迹PPLI"},

	//监视
	{"3 0", "参考点"},				{"3 1", "紧急点"},				{"3 2", "空中航迹"},
	{"3 3", "水面航迹"},			{"3 4", "水下航迹"},			{"3 5", "陆地点/航迹"},
	{"3 6", "空间航迹"},			{"3 7", "电子战产品信息"},

	//反潜战
	{"5 4", "声方位/距离"},

	//情报
	{"6 0", "情报信息"},

	//信息管理
	{"7 0", "航迹管理"},			{"7 1", "数据更新请求"},		{"7 2", "相关"},
	{"7 3", "指示符"},				{"7 4", "航迹标识符"},			{"7 5", "IFF/SIF管理"},
	{"7 6", "过滤器管理"},			{"7 7", "关联"},				{"8 0", "单元代号"},
	{"8 1", "任务相关器变更"},

	//武器协同与管理
	{"9 0", "命令"},				{"9 1", "战斗协同"},			{"9 2", "ECCM协同"},
	{"10 2", "交战状态"},			{"10 3", "交接"},				{"10 5", "控制单元报告"},
	{"10 6", "配对"},

	//控制
	{"12 0", "任务分配"},			{"12 1", "引导"},				{"12 2", "精确飞机引导"},
	{"12 3", "飞行路径"},			{"12 4", "控制单元变更"},		{"12 5", "目标/航迹相关"},
	{"12 6", "目标分类"},			{"12 7", "目标方位"},			{"17 0", "目标上空天气"},


	//平台和系统状态
	{"13 0", "机场状态"},			{"13 2", "空中平台和系统状态"},	{"13 3", "水面平台和系统状态"},
	{"13 4", "水下平台和系统状态"},	{"13 5", "陆地平台和系统状态"},

	//电子战
	{"14 0", "参数信息"},			{"14 2", "电子战控制/协同"},

	//威胁告警
	{"15 0", "威胁告警"},

	//其他
	{"31 0", "空中密钥重配管理"},	{"31 1", "空中密钥重配"},		{"31 7", "空闲信息"}
};